### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "cataprato-core-lambda"
!       last_modified                  = "2023-08-05T04:29:33.323+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:1",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:1" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:1/invocations" -> (known after apply)
+       s3_object_version              = "null"
        tags                           = {}
!       version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "1" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7998777001289125626" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691209722176080000" -> "1691280216661820000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:1" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-05T04:29:22.004+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3:1" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-core-layer-s3" -> (known after apply)
+       s3_object_version           = "null"
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "n7pqs4t9Os5MW3VMir5BSjMzhs7uDw0qTrLD6vXUA5A=" -> (known after apply)
!       source_code_size            = 27196 -> (known after apply)
!       version                     = "1" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "3614466643197314784" -> (known after apply)
!       triggers = {
!           "timestamp" = "1691209722193508000" -> "1691280216678583000"
            # (1 unchanged element hidden)
        }
    }

Plan: 4 to add, 1 to change, 4 to destroy.
```
</details>